IDENTIFICATION DIVISION
PROGRAM-ID. DEPOSIT
ENVIRONMENT DIVISION
INPUT-OUTPUT SECTION
FILE-CONTROL
  SELECT CUSTOMER-FILE ASSIGN TO "USERS.DAT"
    ORGANIZATION IS SEQUENTIAL
  SELECT TRANS-FILE ASSIGN TO "TRANSACTIONS.DAT"
    ORGANIZATION IS SEQUENTIAL

DATA DIVISION
FILE SELECTION
FD CUSTOMER-FILE
01 CUSTOMER-RECORD
  05 CUST-ID PIC X(10)
  05 CUST-NAME PIC X(30)
  05 BALANCE PIC 9(7)V99
  05 ACC-TYPE PIC X
  05 STATUS PIC X

FD TRANS-FILE
01 TRANS-RECORD
  05 T-ACCT-ID PIC X(10)
  05 T-TYPE PIC X
  05 T-AMOUNT PIC 9(7)V99
  05 T-DATE PIC X(10)
  05 T-TIME PIC X(8)

WORKING-STORAGE SECTION
01 DEPOSIT-AMOUNT PIC 9(7)V99

PROCEDURE DIVISION
  DISPLAY "ENTER ACCOUNT ID: "
  ACCEPT CUST-ID
  DISPLAY "ENTER DEPOSIT AMOUNT: "
  ACCEPT DEPOSIT-AMOUNT
  *Get Account
  *Write to records and transactions
  STOP RUN
